core/src/main/resources/order_template/changemobiletype.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oed="http://tot.co.th/totom/interface/oedata">
   <soapenv:Header/>
   <soapenv:Body>
      <oed:SubmitRequest>
         <OrderId>{2}</OrderId>
         <SourceSystemId>OMWeb</SourceSystemId>
         <OrderUserId>{3}</OrderUserId>
         <OrderDateTime>{1}</OrderDateTime>
         <OrderType>SUBMIT</OrderType>
         <OperationCode>MODMOBILETYPE</OperationCode>
         <OrderItems>
            <OrderItem>
               <OrderItemType>ACCESS</OrderItemType>
               <OrderItemAction>MOD</OrderItemAction>
               <OrderItemId>ACCESS{2}</OrderItemId>
               <OrderItemParentId/>
            </OrderItem>
            <OrderItem>
               <OrderItemType>PLAN</OrderItemType>
               <OrderItemAction>ADD</OrderItemAction>
               <OrderItemId>PLAN{2}</OrderItemId>
               <OrderItemParentId>ACCESS{2}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>PlanId</Name>
                     <Value>{4}</Value>
                  </Attribute>
               </Attributes>
            </OrderItem>
            <OrderItem>
               <OrderItemType>SIM</OrderItemType>
               <OrderItemAction>DEL</OrderItemAction>
               <OrderItemId>SIM1{2}</OrderItemId>
               <OrderItemParentId>ACCESS{2}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>IMSI</Name>
                     <Value>{5}</Value>
                  </Attribute>
               </Attributes>
            </OrderItem>
            <OrderItem>
               <OrderItemType>SIM</OrderItemType>
               <OrderItemAction>ADD</OrderItemAction>
               <OrderItemId>SIM2{2}</OrderItemId>
               <OrderItemParentId>ACCESS{2}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>IMSI</Name>
                     <Value>{6}</Value>
                  </Attribute>
               </Attributes>
            </OrderItem>
            <OrderItem>
               <OrderItemType>MSISDN</OrderItemType>
               <OrderItemAction>REF</OrderItemAction>
               <OrderItemId>MSISDN{2}</OrderItemId>
               <OrderItemParentId>ACCESS{2}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>Number</Name>
                     <Value>{0}</Value>
                  </Attribute>
               </Attributes>
            </OrderItem>
         </OrderItems>
      </oed:SubmitRequest>
   </soapenv:Body>
</soapenv:Envelope>
